---
kind: method
id: M:Autodesk.Revit.DB.Electrical.VoltageTypeSet.Contains(Autodesk.Revit.DB.Electrical.VoltageType)
source: html/91da52d0-ce53-7a0c-88f6-8a85b62abae7.htm
---
# Autodesk.Revit.DB.Electrical.VoltageTypeSet.Contains Method

Tests for the existence of a voltage type within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	VoltageType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.VoltageType`) - The voltage type to be searched for.

## Returns
The Contains method returns True if the voltage type is within the set, otherwise False.